In [1]:
import pandas as pd

df = pd.read_excel("D:/shaff/kuliah/semester5/STQA/web_wrapping/hasil_tagihan.xlsx")

df.head()

          NIM  Jumlah Tagihan
0  H071221001  Rp.3.750.000,-
1  H071221002  Rp.3.000.000,-
2  H071221003  Rp.3.000.000,-
3  H071221004    Rp.750.000,-
4  H071221005  Rp.3.000.000,-

In [2]:
df.describe()

               NIM           Jumlah Tagihan
count           50                       50
unique          50                        7
top     H071221001  Tagihan tidak ditemukan
freq             1                       34

In [7]:
df["Jumlah Tagihan"].unique()

for i in df["Jumlah Tagihan"].unique():
    print(i)

Rp.3.750.000,-
Rp.3.000.000,-
Rp.750.000,-
Tagihan tidak ditemukan
Rp.4.500.000,-
Rp.2.000.000,-
Rp.0,-

In [10]:
df["Jumlah Tagihan"].value_counts()

Jumlah Tagihan
Tagihan tidak ditemukan    34
Rp.4.500.000,-              5
Rp.3.000.000,-              4
Rp.3.750.000,-              2
Rp.750.000,-                2
Rp.2.000.000,-              2
Rp.0,-                      1
Name: count, dtype: int64